/*********************************************************************************************************
//概述：
//作者：随风飘跃    时间：       地点：
//CPU型号：         系统主频：
//版本号：V0.0        
*********************************************************************************************************/

#ifndef __MAIN_H__
#define __MAIN_H__
/*********************************************************************************************************
文件包含区
*********************************************************************************************************/
#include "include.h"
/*********************************************************************************************************
宏定义区
*********************************************************************************************************/
#define  BLD_VERSION       "NB_BLD_V1.0"                 //软件版本V1.0

//用户代码的起始地址
#define APP_START_ADDR     ((uint32_t)0x8000+0x6000)

#define  EEPROM_ADD             0X00001000           //EEPROM 初始地址设置  
#define  INTERRUPT_VECTOR_ADD   (EEPROM_ADD)         //中断向量表存储地址
#define  BLD_VERSION_ADD        (EEPROM_ADD+128)     //引导程序软件版本地址
#define  APP_VERSION_ADD        (EEPROM_ADD+128+12)     //应用程序软件版本地址
#define  BOOT_FLAG_ADD          (EEPROM_ADD+128+24)     //启动标志地址
#define  CJT_188_ADD            (EEPROM_ADD+128+34)      //188地址存储
#define  ADD_FLOW_ADD           (EEPROM_ADD+128+44)      //累积流量地址
#define  ACCOUNT_FLOW_ADD       (EEPROM_ADD+128+48)      //结算日流量地址
#define  SETTLE_DATE_ADD        (EEPROM_ADD+128+52)     //结算日期地址
#define  REPORT_CYCLE_ADDR      (EEPROM_ADD+128+53)     //上报周期
#define  BAT_ALARM_ADD          (EEPROM_ADD+128+55)     //电池报警值地址

#define  SDCF1_ADDR             (EEPROM_ADD+128+60)      //上1月结算日流量地址
#define  SDCF2_ADDR             (EEPROM_ADD+128+64)      //上2月结算日流量地址
#define  SDCF3_ADDR             (EEPROM_ADD+128+68)      //上3月结算日流量地址
#define  SDCF4_ADDR             (EEPROM_ADD+128+72)      //上4月结算日流量地址
#define  SDCF5_ADDR             (EEPROM_ADD+128+76)      //上5月结算日流量地址
#define  SDCF6_ADDR             (EEPROM_ADD+128+70)      //上6月结算日流量地址
#define  SDCF7_ADDR             (EEPROM_ADD+128+74)      //上7月结算日流量地址
#define  SDCF8_ADDR             (EEPROM_ADD+128+78)      //上8月结算日流量地址
#define  SDCF9_ADDR             (EEPROM_ADD+128+82)      //上9月结算日流量地址
#define  SDCF10_ADDR            (EEPROM_ADD+128+86)      //上10月结算日流量地址
#define  SDCF11_ADDR            (EEPROM_ADD+128+90)      //上11月结算日流量地址
#define  SDCF12_ADDR            (EEPROM_ADD+128+94)      //上12月结算日流量地址
#define  SDCF13_ADDR            (EEPROM_ADD+128+98)      //上13月结算日流量地址

//#define  VERSION        *((const unsigned char *)(SOFTWARE_VERSION_ADD))
/*********************************************************************************************************
数据类型定义
*********************************************************************************************************/
/*********************************************************************************************************
外部变量声明区
*********************************************************************************************************/

/*********************************************************************************************************
函数声明区
*********************************************************************************************************/
void Led_Green_ON(void);
void Led_Green_OFF(void);
void Sleep(void);
void IWDG_INIT(void);
/********************************************************************************************************/
#endif

/******************************************END********************************************************/
